app/controllers/api/peticiones_controller.rb

	  def index
        respond_with Peticione.all
---
SELECT "peticiones".* FROM "peticiones"  ORDER BY id DESC

      def show
      	respond_with Peticione.find_by_id(params[:id])
---
SELECT  "peticiones".* FROM "peticiones" WHERE "peticiones"."id" = ?  ORDER BY id DESC LIMIT 1  [["id", 92]]