app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT "messages".* FROM "messages"  ORDER BY created_at DESC

    def set_message
      @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ?  ORDER BY created_at DESC LIMIT 1  [["id", 21]]