app/controllers/peticiones_controller.rb

  def index
    @peticiones = Peticione.all
---
SELECT "peticiones".* FROM "peticiones"  ORDER BY id DESC

  def show
    @ubicacion = Peticione.find_by_id(params[:id])
---
SELECT  "peticiones".* FROM "peticiones" WHERE "peticiones"."id" = ?  ORDER BY id DESC LIMIT 1  [["id", 92]]

  def listpeticions
    @peticione = Peticione.all
---
SELECT "peticiones".* FROM "peticiones"  ORDER BY id DESC