app/controllers/renders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 39]]
UPDATE "users" SET "status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["status", "t"], ["updated_at", "2015-06-10 05:24:47.196853"], ["id", 39]]
---
	def statusupdate
    	@usuarios = User.find_by_id (current_user.id)
    	@usuarios.status = params[:statususer]
    	@usuarios.save